app/views/discussions/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."discussion_id" = $1  [["discussion_id", 3]]
---
            <span class="float-right text-muted">
              <%= pluralize discussion.likes.count, 'Like' %> | 23 Comments