app/views/jobs/index.html.erb

        <td><%= job.description %></td>
        <td><%= link_to Category.find(job.category_id).name, category_path(job.category_id) %></td>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]