app/views/users/show.html.erb

  <div class="col-md-8">
    <% @user.discussions.each do |discussion| %>
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."user_id" = $1  [["user_id", 9]]

          <span class="float-right text-muted">
              <%= pluralize discussion.likes.count, 'Like' %> | 23 Comments
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."discussion_id" = $1  [["discussion_id", 11]]