app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "What a Post!"], ["commentable_id", 9], ["commentable_type", "Discussion"], ["created_at", "2017-12-06 14:56:51.866494"], ["updated_at", "2017-12-06 14:56:51.866494"]]
UPDATE "comments" SET "lft" = CASE WHEN "lft" BETWEEN 4 AND 4 THEN "lft" + 6 - 4 WHEN "lft" BETWEEN 5 AND 6 THEN "lft" + 4 - 5 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 4 AND 4 THEN "rgt" + 6 - 4 WHEN "rgt" BETWEEN 5 AND 6 THEN "rgt" + 4 - 5 ELSE "rgt" END, "parent_id" = CASE WHEN "id" = 3 THEN 2 ELSE "parent_id" END, updated_at = '2018-01-10 08:58:17.174800' WHERE "comments"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."commentable_id" = $1 AND "comments"."commentable_type" = $2 AND ("comments"."lft" BETWEEN 4 AND 6 OR "comments"."rgt" BETWEEN 4 AND 6) ORDER BY "comments"."lft")  [["commentable_id", 11], ["commentable_type", "Discussion"]]
---
  def create
    commentable = commentable_type.constantize.find(commentable_id)
    @comment = Comment.build_from(commentable, current_user.id, body)


      if @comment.save