app/controllers/discussions_controller.rb

SELECT "discussions".* FROM "discussions" ORDER BY created_at DESC
---
  def index
    @discussions = Discussion.all.sorted

INSERT INTO "discussions" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "qqqqqqqqqqqq"], ["created_at", "2017-11-29 16:50:08.694007"], ["updated_at", "2017-11-29 16:50:08.694007"]]
---
  def create
    @discussion = current_user.discussions.new(discussion_params)

    respond_to do |format|
      if @discussion.save

DELETE FROM "discussions" WHERE "discussions"."id" = $1  [["id", 1]]
---
  def destroy
    @discussion.destroy

INSERT INTO "likes" ("user_id", "discussion_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["discussion_id", 3], ["created_at", "2017-12-02 10:42:58.056781"], ["updated_at", "2017-12-02 10:42:58.056781"]]
---
  def like
    #@like = @discussion.likes.build(user: current_user)
    if @discussion.likes.create(user: current_user)

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_discussion
      @discussion = Discussion.find(params[:id])