app/controllers/jobs_controller.rb

  def index
    @job = current_user.jobs.new
    @categories = Category.all.map{|c| [ c.name, c.id ] }
---
SELECT  "categories".* FROM "categories" WHERE "categories"."name" IS NULL LIMIT $1  [["LIMIT", 1]]

  def new
    @job = current_user.jobs.new
    @categories = Category.all.map{|c| [ c.name, c.id ] }
---
SELECT "categories".* FROM "categories"