app/controllers/users_controller.rb

UPDATE "users" SET "profile_picture_file_name" = $1, "profile_picture_file_size" = $2, "profile_picture_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5
---
  def update_info
    if current_user.update(user_info_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def set_users
    @user = User.friendly.find(params[:id])